src/InformationRegisters/СпецификацииИзделий/СпецификацииИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпецификацииИзделий</name>
  <resources>
    <name>ТипПроизводственногоПроцесса</name>
    <type>
      <types>EnumRef.ТипыПроизводственныхПроцессов</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСпецификаций</types>
    </type>
  </resources>
  <resources>
    <name>ПобочныйВыход</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоУпаковокНаЕдиницуПартииЗапуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонецДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияШтучная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КлючСвязи</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыСпецификаций/СтатусыСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСпецификаций</name>
  <enumValues>
    <name>ВРазработке</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СпособыАвтовыбораНоменклатуры/СпособыАвтовыбораНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыАвтовыбораНоменклатуры</name>
  <enumValues>
    <name>УказываетсяВНСИ</name>
  </enumValues>
  <enumValues>
    <name>ЗадаетсяВСвойствеПродукции</name>
  </enumValues>
  <enumValues>
    <name>УточняетсяПриПроизводстве</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СпособыПолученияМатериаловВСпецификации/СпособыПолученияМатериаловВСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПолученияМатериаловВСпецификации</name>
  <enumValues>
    <name>Обеспечивать</name>
  </enumValues>
  <enumValues>
    <name>ПроизвестиПоСпецификации</name>
  </enumValues>
  <enumValues>
    <name>ПроизводитсяНаЭтапе</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОбеспечиватьОбособленно</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Безразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейныеРазмерыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <type>
      <types>CatalogRef.СкладскиеГруппыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.ТипоразмерыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/СпецификацииИзделий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает данные об изделиях спецификации в регистр
//
// Параметры:
//  Спецификации  - СправочникСсылка.РесурсныеСпецификации, Массив - спецификации, для которой записываются изделия.
//  ОчисткаЗаписейРегистра - Булево - определяет необходимость записи данных, либо только очистку уже имеющихся в регистре
//  ВызовИзОбработчикаОбновления - Булево - режим вызова из обработчика обновления
//
Процедура ЗаписатьИзделияПоСпецификации(Спецификации, ОчисткаЗаписейРегистра = Ложь, ВызовИзОбработчикаОбновления = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаИзделияСпецификации(ВызовИзОбработчикаОбновления);
	Запрос.УстановитьПараметр("Спецификации",     Спецификации);
	Запрос.УстановитьПараметр("ПрочитатьИзделия", НЕ ОчисткаЗаписейРегистра);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаСпецификации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Спецификация");
		Пока ВыборкаСпецификации.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.СпецификацииИзделий.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Спецификация.Установить(ВыборкаСпецификации.Спецификация);
			
			Порядок = 1;
			
			Выборка = ВыборкаСпецификации.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока Выборка.Следующий() И Выборка.НомерСтроки <> Null Цикл
				
				НоваяСтрока = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.Порядок = Порядок;
				
				Порядок = Порядок + 1;
				
			КонецЦикла;
			
			Если ВызовИзОбработчикаОбновления Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			Иначе
				НаборЗаписей.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Функция ТекстЗапросаИзделияСпецификации(ВызовИзОбработчикаОбновления = Ложь)
	
	ТекстЗапроса = "
	|// Сборка, Ремонт
	|ВЫБРАТЬ
	|	Т.Ссылка                                  КАК Спецификация,
	|	ВЫБОР
	|		КОГДА Т.Ссылка.ВариантНазначения = ЗНАЧЕНИЕ(Перечисление.ВариантыНазначенияСпецификации.ВидНоменклатуры)
	|			ТОГДА Т.ВидНоменклатуры
	|		ИНАЧЕ ЕСТЬNULL(Т.Номенклатура.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка))
	|	КОНЕЦ                                     КАК Видноменклатуры,
	|	Т.Номенклатура                            КАК Номенклатура,
	|	Т.Характеристика                          КАК Характеристика,
	|	Т.КоличествоУпаковок                      КАК КоличествоУпаковокНаЕдиницуПартииЗапуска,
	|	Т.Упаковка                                КАК Упаковка,
	|	Т.Ссылка.ТипПроизводственногоПроцесса     КАК ТипПроизводственногоПроцесса,
	|	Т.Ссылка.Статус                           КАК Статус,
	|	Т.Ссылка.НачалоДействия                   КАК НачалоДействия,
	|	Т.Ссылка.КонецДействия                    КАК КонецДействия,
	|	Т.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК ЕдиницаИзмеренияШтучная,
	|	Т.НомерСтроки                             КАК НомерСтроки,
	|	Т.КлючСвязи                               КАК КлючСвязи,
	|	ЛОЖЬ                                      КАК ПобочныйВыход
	|ПОМЕСТИТЬ
	|	ВтИзделия
	|ИЗ
	|	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК Т
	|ГДЕ
	|	Т.Ссылка В (&Спецификации)
	|	И Т.Ссылка.ТипПроизводственногоПроцесса В (ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Сборка),
	|													ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Ремонт))
	|	И Т.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует), ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.ВРазработке))
	|	И Т.СпособАвтовыбораНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ),
	|											ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораНоменклатуры.ПустаяСсылка))
	|	И Т.СпособАвтовыбораХарактеристики В (ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ),
	|											ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораХарактеристики.ПустаяСсылка))
	|	И (ВЫРАЗИТЬ(Т.АлгоритмРасчетаКоличества КАК СТРОКА(100))) = """"
	|	И ВЫБОР
	|		КОГДА Т.Ссылка.ВариантНазначения = ЗНАЧЕНИЕ(Перечисление.ВариантыНазначенияСпецификации.ВидНоменклатуры)
	|			ТОГДА Т.ВидНоменклатуры
	|		ИНАЧЕ ЕСТЬNULL(Т.Номенклатура.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка))
	|	КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|	И (Т.НомерСтроки = 1
	|			ИЛИ &ТекстПодстановкиРасчетПризнакаЕстьПараметризацияРесурсов = ЛОЖЬ)
	|	И &ПрочитатьИзделия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Побочный выпуск
	|ВЫБРАТЬ
	|	ПобочныйВыпуск.Спецификация,
	|	ПобочныйВыпуск.ВидНоменклатуры,
	|	ПобочныйВыпуск.Номенклатура,
	|	ПобочныйВыпуск.Характеристика,
	|	СУММА(ПобочныйВыпуск.Количество),
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
	|	ПобочныйВыпуск.ТипПроизводственногоПроцесса,
	|	ПобочныйВыпуск.Статус,
	|	ПобочныйВыпуск.НачалоДействия,
	|	ПобочныйВыпуск.КонецДействия,
	|	ПобочныйВыпуск.ЕдиницаИзмеренияШтучная,
	|	МИНИМУМ(ПобочныйВыпуск.НомерСтроки),
	|	МИНИМУМ(ПобочныйВыпуск.КлючСвязи),
	|	ИСТИНА
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Ссылка                              КАК Спецификация,
	|		Т.Ссылка.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
	|		Т.Ссылка.Статус                       КАК Статус,
	|		Т.Ссылка.НачалоДействия               КАК НачалоДействия,
	|		Т.Ссылка.КонецДействия                КАК КонецДействия,
	|		Т.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК ЕдиницаИзмеренияШтучная,
	|		Т.Номенклатура.ВидНоменклатуры        КАК ВидНоменклатуры,
	|		Т.Номенклатура                        КАК Номенклатура,
	|		Т.Характеристика                      КАК Характеристика,
	|		Т.НомерСтроки                         КАК НомерСтроки,
	|		Т.КлючСвязи                           КАК КлючСвязи,
	|		ВЫРАЗИТЬ(Т.КоличествоУпаковок * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК ЧИСЛО(15, 3)) КАК Количество
	|	ИЗ
	|		Справочник.РесурсныеСпецификации.ВозвратныеОтходы КАК Т
	|	ГДЕ
	|		Т.Ссылка В (&Спецификации)
	|		И Т.Ссылка.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Сборка)
	|		И Т.СпособАвтовыбораНоменклатуры = ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ)
	|		И Т.СпособАвтовыбораХарактеристики = ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ)
	|		И (ВЫРАЗИТЬ(Т.АлгоритмРасчетаКоличества КАК СТРОКА(100))) = """"
	|		И &ПрочитатьИзделия
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.Ссылка.ТипПроизводственногоПроцесса,
	|		Т.Ссылка.Статус,
	|		Т.Ссылка.НачалоДействия,
	|		Т.Ссылка.КонецДействия,
	|		Т.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК ЕдиницаИзмеренияШтучная,
	|		Т.Номенклатура.ВидНоменклатуры,
	|		Т.Номенклатура,
	|		Т.Характеристика,
	|		10000,
	|		Т.КлючСвязи,
	|		-(ВЫРАЗИТЬ(Т.КоличествоУпаковок * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК ЧИСЛО(15, 3)))
	|	ИЗ
	|		Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК Т
	|	ГДЕ
	|		Т.Ссылка В (&Спецификации)
	|		И Т.Ссылка.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Сборка)
	|		И Т.СпособПолученияМатериала = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе)
	|		И Т.СпособАвтовыбораНоменклатуры = ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ)
	|		И Т.СпособАвтовыбораХарактеристики = ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ)
	|		И (ВЫРАЗИТЬ(Т.АлгоритмРасчетаКоличества КАК СТРОКА(100))) = """"
	|		И &ПрочитатьИзделия) КАК ПобочныйВыпуск
	|
	|СГРУППИРОВАТЬ ПО
	|	ПобочныйВыпуск.Спецификация,
	|	ПобочныйВыпуск.ВидНоменклатуры,
	|	ПобочныйВыпуск.Номенклатура,
	|	ПобочныйВыпуск.Характеристика,
	|	ПобочныйВыпуск.ТипПроизводственногоПроцесса,
	|	ПобочныйВыпуск.Статус,
	|	ПобочныйВыпуск.НачалоДействия,
	|	ПобочныйВыпуск.КонецДействия,
	|	ПобочныйВыпуск.ЕдиницаИзмеренияШтучная
	|	
	|ИМЕЮЩИЕ
	|	СУММА(ПобочныйВыпуск.Количество) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Разборка
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	ВЫБОР
	|		КОГДА Т.ВариантНазначения = ЗНАЧЕНИЕ(Перечисление.ВариантыНазначенияСпецификации.ВидНоменклатуры)
	|			ТОГДА Т.ОсновноеИзделиеВидНоменклатуры
	|		ИНАЧЕ ЕСТЬNULL(Т.ОсновноеИзделиеНоменклатура.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка))
	|	КОНЕЦ,
	|	Т.ОсновноеИзделиеНоменклатура,
	|	Т.ОсновноеИзделиеХарактеристика,
	|	Т.ОсновноеИзделиеКоличествоУпаковок,
	|	Т.ОсновноеИзделиеУпаковка,
	|	Т.ТипПроизводственногоПроцесса,
	|	Т.Статус,
	|	Т.НачалоДействия,
	|	Т.КонецДействия,
	|	Т.ОсновноеИзделиеНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК ЕдиницаИзмеренияШтучная,
	|	1,
	|	NULL,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.РесурсныеСпецификации КАК Т
	|ГДЕ
	|	Т.Ссылка В (&Спецификации)
	|	И Т.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
	|	И Т.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует), ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.ВРазработке))
	|	И ВЫБОР
	|		КОГДА Т.ВариантНазначения = ЗНАЧЕНИЕ(Перечисление.ВариантыНазначенияСпецификации.ВидНоменклатуры)
	|			ТОГДА Т.ОсновноеИзделиеВидНоменклатуры
	|		ИНАЧЕ ЕСТЬNULL(Т.ОсновноеИзделиеНоменклатура.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка))
	|	КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|	И &ПрочитатьИзделия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Спецификация
	|
	|;
	|
	|ВЫБРАТЬ
	|	Спецификации.Ссылка КАК Спецификация,
	|	Изделия.*
	|ИЗ
	|	Справочник.РесурсныеСпецификации КАК Спецификации
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтИзделия КАК Изделия
	|		ПО Спецификации.Ссылка = Изделия.Спецификация
	|ГДЕ
	|	Спецификации.Ссылка В (&Спецификации)
	|	И НЕ ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					ВтИзделия КАК Т
	|				ГДЕ
	|					Изделия.Спецификация = Т.Спецификация
	|					И Изделия.Номенклатура = Т.Номенклатура
	|					И Изделия.Характеристика = Т.Характеристика
	|					И ВЫБОР
	|						КОГДА Изделия.ПобочныйВыход = Т.ПобочныйВыход
	|							ТОГДА Т.НомерСтроки < Изделия.НомерСтроки
	|						ИНАЧЕ Т.ПобочныйВыход < Изделия.ПобочныйВыход
	|					КОНЕЦ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Изделия.ПобочныйВыход,
	|	Изделия.НомерСтроки
	|
	|ИТОГИ ПО
	|	Спецификации.Ссылка
	|
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаКоэффициентУпаковкиОсновноеИзделие",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"Т.ОсновноеИзделиеУпаковка",
			"Т.ОсновноеИзделиеНоменклатура"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"Т.Упаковка",
			"Т.Номенклатура"));
			
	Если ВызовИзОбработчикаОбновления Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстПодстановкиРасчетПризнакаЕстьПараметризацияРесурсов",
			Справочники.РесурсныеСпецификации.ТекстПодстановкиРасчетПризнакаЕстьПараметризацияРесурсов("Т.Ссылка"));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстПодстановкиРасчетПризнакаЕстьПараметризацияРесурсов",
			"Т.Ссылка.ЕстьПараметризацияРесурсов");
	КонецЕсли;
			
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
